;;;  -*- lexical-binding: t; -*-
;;;  -*- no-byte-compile: t; -*-

(package! flycheck-aspell)
(package! async)
(package! calfw)
(package! calfw-org)
(package! dashboard)
(package! dired-open)
(package! dmenu)
(package! emojify)
(package! evil-tutor)
(package! ivy-posframe)
(package! org-bullets)
(package! peep-dired)
(package! rainbow-mode)
(package! resize-window)
(package! tldr)
(package! wc-mode)

(package! ob-typescript)
(package! indium)
(package! reason-mode)
(package! prettier-js)
(package! org-fancy-priorities)
(package! move-text)
(package! vue-mode)
(package! origami)
(package! org-super-agenda)
(package! deadgrep)
(package! dart-mode)
(package! ob-dart)
(package! sql-indent)
(package! org-brain)
(package! ascii-art-to-unicode)
(package! wakatime-mode)
(package! tree-sitter)
(package! tree-sitter-langs)
(package! meson-mode)